recipes/yogurt-mince-pasta.org
#+TITLE: Yogurt mince pasta
#+DATE: 2025-02-09
#+SETUPFILE: recipe.setup

* Ingredients
** Tofu mince
- 2 tbsp neutral oil
- 1 red onion chopped
- 2 cups grated tofu
- 3 tbsp dark soy sauce
- 1 tbsp ketchup
- 1 tbsp vegan beef stock powder (optional)
- 1 tsp smoked paprika
- 1 tsp chilli flakes
- 1 tsp garlic powder
** Yogurt sauce
- 1 cup unsweetened vegan yogurt
- 1 garlic clove mince
- 1 tsp lemon juice
- salt to taste
** Paprika butter
- 4 tbsp vegan butter
- 1/2 tbsp smoked paprika
** Garnish
- chopped tomato
- chopped parsley
- boiled pasta of your choice

* Instructions
  1. Cook tofu ingredients low and slow for 25-30 minutes until it dries up and crisps up slightly
  2. Cook pasta
  3. Mix yogurt sauce ingredients
  4. Bring butter to slow boil and add paprika
  5. Top pasta with yogurt, mince then butter
