recipes/yogurt-mince-pasta.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yogurt mince pasta</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Yogurt mince pasta</h1>

<div id="outline-container-orgba8313f" class="outline-2">
<h2 id="orgba8313f">Ingredients</h2>
<div class="outline-text-2" id="text-orgba8313f">
</div>
<div id="outline-container-orgb506167" class="outline-3">
<h3 id="orgb506167">Tofu mince</h3>
<div class="outline-text-3" id="text-orgb506167">
<ul class="org-ul">
<li>2 tbsp neutral oil</li>
<li>1 red onion chopped</li>
<li>2 cups grated tofu</li>
<li>3 tbsp dark soy sauce</li>
<li>1 tbsp ketchup</li>
<li>1 tbsp vegan beef stock powder (optional)</li>
<li>1 tsp smoked paprika</li>
<li>1 tsp chilli flakes</li>
<li>1 tsp garlic powder</li>
</ul>
</div>
</div>
<div id="outline-container-org8d01526" class="outline-3">
<h3 id="org8d01526">Yogurt sauce</h3>
<div class="outline-text-3" id="text-org8d01526">
<ul class="org-ul">
<li>1 cup unsweetened vegan yogurt</li>
<li>1 garlic clove mince</li>
<li>1 tsp lemon juice</li>
<li>salt to taste</li>
</ul>
</div>
</div>
<div id="outline-container-org6de8e2c" class="outline-3">
<h3 id="org6de8e2c">Paprika butter</h3>
<div class="outline-text-3" id="text-org6de8e2c">
<ul class="org-ul">
<li>4 tbsp vegan butter</li>
<li>1/2 tbsp smoked paprika</li>
</ul>
</div>
</div>
<div id="outline-container-org467ba49" class="outline-3">
<h3 id="org467ba49">Garnish</h3>
<div class="outline-text-3" id="text-org467ba49">
<ul class="org-ul">
<li>chopped tomato</li>
<li>chopped parsley</li>
<li>boiled pasta of your choice</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2f387d4" class="outline-2">
<h2 id="org2f387d4">Instructions</h2>
<div class="outline-text-2" id="text-org2f387d4">
<ol class="org-ol">
<li>Cook tofu ingredients low and slow for 25-30 minutes until it dries up and crisps up slightly</li>
<li>Cook pasta</li>
<li>Mix yogurt sauce ingredients</li>
<li>Bring butter to slow boil and add paprika</li>
<li>Top pasta with yogurt, mince then butter</li>
</ol>
</div>
</div>
</div>
</body>
</html>
